app/controllers/carreras_controller.rb

  def index
    @carreras = Carrera.all
---
SELECT * FROM "carreras"