app/controllers/espacios_controller.rb

  def index
    @espacios = Espacio.all
---
SELECT * FROM "espacios"