app/controllers/materias_controller.rb

  def index
    @materias = Materia.all
---
SELECT * FROM "materias"