app/controllers/plans_controller.rb

  def index
    @plans = Plan.all
---
SELECT * FROM "plans"