app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', 'b479090694e2754a07a482b67d39836c52929faf', '2009-10-05 21:28:30', '9e5a858362da9a0b19b93f50b6940066d9b04809', NULL, '2009-10-05 21:28:30', NULL, 'lalala', 'lol@mascaracteres.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save